Revit 2027 API
TaskDialogIcon Enumeration
 Standard icons to be used in the task dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TaskDialogIcon
Public Enumeration TaskDialogIcon
public enum class TaskDialogIcon
type TaskDialogIcon
Members
Member name | Value | Description
TaskDialogIconError | 65,534 | Error icon.
TaskDialogIconInformation | 65,533 | Information icon.
TaskDialogIconNone | 0 | No icon.
TaskDialogIconShield | 65,532 | Shield icon.
TaskDialogIconWarning | 65,535 | Warning icon.
See Also
Reference
Autodesk.Revit.UI Namespace